<?php
// Text
$_['text_subject']          = '%s - Поръчка %s';
$_['text_greeting']         = 'Здравейте, вие поръчахте на сайта на Шоколана. Вашата поръчка е приета и ще бъде обработена.';
$_['text_link']             = 'За да видите поръчката си, кликнете върху връзката по-долу:';
$_['text_order_detail']     = 'Подробности за поръчката';
$_['text_instruction']      = 'Инструкции';
$_['text_order_id']         = 'Вашият номер на поръчка е:';
$_['text_date_added']       = 'Датата е добавена:';
$_['text_order_status']     = 'Статус на поръчката:';
$_['text_payment_method']   = 'Начин на плащане:';
$_['text_shipping_method']  = 'Начин на доставка:';
$_['text_email']            = 'E-mail:';
$_['text_telephone']        = 'Телефон:';
$_['text_ip']               = 'IP Address:';
$_['text_payment_address']  = 'Адрес за плащане';
$_['text_shipping_address'] = 'Адрес за доставка';
$_['text_products']         = 'Продукти';
$_['text_product']          = 'Продукт';
$_['text_model']            = 'Модел';
$_['text_quantity']         = 'Количество';
$_['text_price']            = 'Цена';
$_['text_order_total']      = 'Общо за поръчка';
$_['text_total']            = 'Обща сума';
$_['text_download']         = 'След като потвърдите плащането, можете да кликнете върху връзката по-долу, за да получите достъп до продуктите, които можете да изтеглите:';
$_['text_comment']          = 'Коментарите за вашата поръчка са:';
$_['text_footer']           = 'Благодаря Ви за поръчката!<br />С обич #шоколана_бг';
