var $ = jQuery.noConflict();

var isDeliveryOnSaturday = false;

$(window).on('load', function () {
	var _html           		= $('html');
	var checkoutBlock   		= $('.block_checkout');

	cart_not_empty();

	block_checkout__check_input();

	block_checkout__form__submit();



	// hide textarea placeholder at page load if it's empty
	comment_check();



	// Дата доставки [START]
	// $('input[name="block_checkout__date"]').click(function () {
	// 	$('body, html').animate({
			// scrollTop: $(this).offset().top + 40
		// }, 700);
	// });

	$('input[name="block_checkout__date"]').mask('00/00/0000');

	// do not delivery on dates below
	var disabledDates = [
		'2021-03-08',
		'2021-03-09',
		'2021-03-10',

		'2021-03-14',
		'2021-03-21',
		'2021-03-28',
	];

	$('input[name="block_checkout__date"]').datepicker({
		beforeShowDay: function(dt) {
			// don't send at Sunday, Monday
			// return [dt.getDay() == 0 || dt.getDay() == 1 ? false : true];

			// don't send at Sunday
			return [dt.getDay() == 0 ? false : true];

			// don't send on special days
			// var string = jQuery.datepicker.formatDate('yy-mm-dd', dt);
			// return [ disabledDates.indexOf(string) == -1]
		},
		dateFormat: 'dd/mm/yy',
		onSelect: function(){
			var date = $(this).datepicker('getDate');
			if (date.getDay() === 6) {
				isDeliveryOnSaturday = true;
			} else {
				isDeliveryOnSaturday = false;
			}
			$(this).parent().removeClass('error').addClass('accepted');
			checkSaturdayDeliveryChangePrice();
			block_checkout__delivery_desc__active();
		},

		// start from Monday
		firstDay: 1,

		// minimum days before send
		minDate: 1
	});
	// Дата доставки [END]



	$('.popup_order__close').click(function () {
		$('html').removeClass('popup_order__complete popup_order__active');
	});

	$('.popup_order__bg').click(function () {
		if ( _html.hasClass('popup_order__complete') ) {
			_html.removeClass('popup_order__complete popup_order__active');
		}
	});



	$('.popup_error__bg, .popup_error__close').click(function () {
		_html.removeClass('popup_error__active');
	});



	// load cart content at page load
	$('.block_cart__wrap').load('index.php?route=common/cart/info #cart__content', function () {
		cart_total();

		cart_not_empty();
		checkSaturdayDeliveryChangePrice();
	});



	// choose payment type [START]
	$('.js-block_checkout__payment_type').click(function () {
		block_checkout__payment__active();
	});

	block_checkout__payment__active();

	function block_checkout__payment__active() {
		var data_payment_type = $('.js-block_checkout__payment_type').find('input:checked').parent().attr('data-payment-type');

		$('.js-block_checkout__payment_type').removeClass('error');

		$('.js-block_checkout__payment_type').removeClass('active');

		$('.block_checkout__payment_desc').removeClass('active');

		$('.js-block_checkout__payment_type[data-payment-type="' + data_payment_type + '"]').addClass('active');

		$('.block_checkout__payment_desc[data-payment-type="' + data_payment_type + '"]').addClass('active');
	}
	// choose payment type [END]



	// choose delivery type [START]
	if ( $('.js-block_checkout__delivery_type').length ) {
		$(document).on('click', '.js-block_checkout__delivery_type', function () {
			block_checkout__delivery_desc__active();
		});

		block_checkout__delivery_desc__active();
	}

	function block_checkout__delivery_desc__active() {
		var data_delivery_type = $('.js-block_checkout__delivery_type').find('input:checked').parent().attr('data-delivery-type');

		$('.js-block_checkout__delivery_type').removeClass('error');

		$('.js-block_checkout__delivery_type').removeClass('active');

		$('.block_checkout__delivery_desc').removeClass('active');

		$('.js-block_checkout__delivery_type[data-delivery-type="' + data_delivery_type + '"]').addClass('active');

		$('.block_checkout__delivery_desc[data-delivery-type="' + data_delivery_type + '"]').addClass('active');

		// change delivery price at the totals
		if ( data_delivery_type == 1 ) {
			$('.block_checkout__total_delivery').find('.block_checkout__total_number').text('6.80');
		}
		else {
			// if Saturday , delivery to address is more expensive
			if (isDeliveryOnSaturday) {
				$('.block_checkout__total_delivery').find('.block_checkout__total_number').text('11.60');
			} else {// other days
				$('.block_checkout__total_delivery').find('.block_checkout__total_number').text('8.80');
			}
		}

		cart_total();
	}
	// choose delivery type [END]



	// plus \ minus at cart [START]
	$(document).on('click', '.cart__quantity__btn', function () {
		var quantity_input = $(this).parent().find('input');
		var data_quantity = parseInt( $(this).attr('data-quantity') );

		quantity_input.val( parseInt(quantity_input.val()) + data_quantity );

		$.ajax({
			url: 'index.php?route=checkout/cart/edit',
			type: 'post',
			data: quantity_input,
			success: function() {
				cart_update();
			},
			error: function(xhr, ajaxOptions, thrownError) {
				console.log('error');
				console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
			}
		});
	});
	// plus \ minus at cart [END]



	// hide placeholder on focus [START]
	var placeholder;

	checkoutBlock.find('input[type="text"]').focus(function () {
		placeholder = $(this).attr('placeholder');

		$(this).attr('placeholder', '');
	});

	checkoutBlock.find('input[type="text"]').blur(function () {
		$(this).attr('placeholder', placeholder);
	});
	// hide placeholder on focus [END]



	// autocomplete Ekont address
	if ( $('.js-ekont-autocompleteXXXXXXX').length ) {
		var EkontAddresses = [
			'Айтос Автогара, 8501, Айтос кв. Айтос ул. Георги Кондолов №7',
			'Айдемир, 7538, Айдемир кв. Деленките ул. София №7',
			'Айтос Орела, 8503, Айтос ул. Васил Левски №44',

			'Аксаково, 9023, Аксаково ж.к. Надежда ул. Капитан Петко Войвода №1',
			'АПС Русенско филхармонично дружество, 1702, Русе кв. Източна Промишлена Зона бул. Тутракан №11',
			'Ардино, 6750, Ардино кв. Бостанджиите ул. Бели брези №21',

			'Асеновград АБВ, 4231, Асеновград кв. Асеновград ул. Гоце Делчев №40 зад сладкарница Нико',
			'Асеновград Запад, 4232, Асеновград кв. Запад бул. България №77 паркинга на хотел "Сани"',
			'Асеновград Христо Ботев, 4233, Асеновград кв. Асеновград ул. Христо Ботев №3',
			'Асеновград, 4234, Асеновград кв. Асеновград ул. Цар Иван Асен ІІ №125',

			'Атина Метаксургиу, 500905, Атина str. DILIGIANI TH №22а',
			'Ахелой, 8217, Ахелой Ахелой ул. Слънчев бряг №1',

			'Балчик Левски, 9604, Балчик кв. Балчик тратра',
			'Балчик, 9600, Балчик кв. Балчик ул. Черно Море №53',
			'Банкя, 1321, Банкя кв. Банкя ул. София №44',

			'Банско Горски Техникум, 2771, Банско кв. Банско ул. Охрид №8',
			'Банско, 2770, Банско кв. Банско ул. Васил Кънчев №8',
			'Белене, 5931, Белене кв. Белене ул.Патриарх Евтимий №23А',
			'Белово, 4470, Белово кв. Белове бул. Освобождение №80',
			'Белоградчик, 3900, Белоградчик кв. Белоградчик бул. Съединение №4',
			'Белозем, 4130, Белозем ул. Река Сребра №2',
			'Белослав, 9179, Белослав ул. Христо Ботев №36',
			'Берковица, 3500, Берковица кв. Берковица ул. Берковска река №11',

			'Благоевград Главна улица, 2707, Благоевград кв. Благоевград ул. Пере Тошев №7',
			'Благоевград Еконт Експрес, 2700, Благоевград кв. Благоевград ул. Покровнишко шосе №20',
			'Благоевград Еленово, 2706, Благоевград ж.к. Еленово ул. Преслав №9',
			'Благоевград Запад, 2704, Благоевград ж.к. Запад ул. Свети Свети Кирил и Методий №31',
			'Благоевград Кончето, 2705, Благоевград кв. Благоевград ул. Иван Михайлов №26',
			'Благоевград Пазара, 2702, Благоевград кв. Благоевград ул. Даме Груев №15',
			'Благоевград Стадиона, 2709, Благоевград кв. Благоевград ул. Стефан Стамболов №51б срещу входа на стадиона',
			'Благоевград Струмско, 2708, Благоевград кв. Струмско ул. Яне Сандански №2Г',

			'Божурище, 2227, Божурище ж.к. Жилища ул. Асен Йорданов №23 блок.23 срещу Пощата',
			'Ботевград Изток, 2144, Ботевград ж.к. Васил Левски ул. Илия Стоянов №3А',
			'Ботевград, 2145, Ботевград ул. Свобода №2',

			'Бургас - Борислав Георгиев, 80288, Бургас кв. Победа ул. Индустриална №47 склад 36 и 41',
			'Бургас - Иван Койчев, 80278, Бургас кв. Победа ул. Индустриална №47 склад 36 и 41',
			'Бургас 24/7 Еконтомат- Автогара Запад, 8015, Бургас ул. Марица №2',
			'Бургас 24/7 Еконтомат- МОЛ Бургас Плаза, 8029, Бургас бул. Транспортна №31',
			'Бургас Братя Миладинови, 8009, Бургас ж.к. Братя Миладинови ул. Марица №135',
			'Бургас Въстаническа, 8018, Бургас ж.к. Меден рудник ул. Въстаническа №5 блок.529',
			'Бургас Дебелянов-Славейков, 8006, Бургас ж.к. Славейков блок.145 офис 2',
			'Бургас Долно Езерово, 8026, Бургас ул. Захари Зограф №75',
			'Бургас Зорница, 8013, Бургас ж.к. Зорница №51 к-с Перла',
			'Бургас Изгрев Транспортна, 8025, Бургас ж.к. Изгрев блок.91',
			'Бургас Изгрев, 8012, Бургас ж.к. Изгрев блок.186 партер',
			'Бургас Лазур, 8004, Бургас ж.к. Лазур блок.100 офис 1',
			'Бургас Меден рудник, 8007, Бургас кв. Зона А блок.383',
			'Бургас Патриарх Евтимий, 8003, Бургас ж.к. Възраждане ул. Пробуда №65',
			'Бургас ПЗ Север, 8011, Бургас кв. 1 ул. Янко Комитов №1 БЦ Мадика /срещу КАТ/',
			'Бургас Роял, 8020, Бургас кв. 1 ул. Оборище №57',
			'Бургас РЦ, 8000, Бургас кв. Победа ул. Индустриална №47 склад 36 и 41',
			'Бургас Сарафово, 8024, Бургас кв. Сарафово ул. Ради Николов №30',
			'Бургас Славейков, 8002, Бургас ж.к. Славейков блок.55 вх.Ж',
			'Бургас Фердинандова, 8014, Бургас ж.к. Възраждане ул. Фердинандова №32',
			'Бургас, 8021, Бургас кв. Победа ул. Индустриална №54',

			'Бяла Слатина, 3201, Бяла Слатина кв. Бяла Слатина ул. Васил Левски №14',
			'Бяла, Rusensko',

			'Варна - Ангел Бучков, 90098, Варна кв. Западна Промишлена Зона Завод Метал',
			'Варна - Димитър Димитров, 90038, Варна кв. Западна Промишлена Зона Завод Метал',
			'Варна - Искра Аврамова, 90028, Варна кв. Западна Промишлена Зона Завод Метал',
			'Варна - Цецо Йорданов, 90018, Варна кв. Западна Промишлена Зона Завод Метал',
			'Варна 24/7 Еконтомат - МОЛ Варна, 9036, Варна бул. Владислав Варненчик №186',
			'Варна 27-ми юли, 9034, Варна Център ул. 27-ми юли №14',
			'Варна Аспарухово, 9032, Варна кв. Аспарухово ул. Димчо Дебелянов №14',
			'Варна Бенковски, 9004, Варна Център ул. Велико Христов №12',
			'Варна Битоля, 9013, Варна Район Приморски ул. Джеймс Баучер №3 срещу блок 3',
			'Варна Виница, 9021, Варна ж.к. Виница ул. Цар Борис III №16',
			'Варна Владиславово, 9018, Варна ул. Ниш №33',
			'Варна Възраждане, 9020, Варна кв. Възраждане ул. Поп Димитър №12 срещу бл.66',
			'Варна ЖП Гара, 9006, Варна Център ул. Цариброд №41 (вход от към ул. Шабла)',
			'Варна Кайсиева градина, 9027, Варна ж.к. Кайсиева градина ул. Петър Дертлиев №36 (до Метро)',
			'Варна Колхозен пазар, 9015, Варна Център ул. Стара планина №41-43',
			'Варна Левски, 9005, Варна кв. Васил Левски ул. Васил Ставрев №2',
			'Варна Майка Тереза, 9028, Варна кв. Възраждане ул. Майка Тереза №6 до бл.7',
			'Варна Младост Гюрлата, 9011, Варна кв. Младост блок.100 Пазар Гюрлата',
			'Варна Пазар Младост, 9033, Варна кв. Младост срещу бл.145',
			'Варна Патриарха, 9003, Варна Район Одесос ул. Калофер №2',
			'Варна Победа, 9031, Варна кв. Победа ул. Тодор Пенев №11',
			'Варна РЦ, 9000, Варна кв. Западна Промишлена Зона Завод Метал',
			'Варна Спартак, 9017, Варна Район Одесос ул. Неофит Рилски №22',
			'Варна стадион Черно море, 9007, Варна кв. Васил Левски ул. Доктор Анастасия Железкова №5A',
			'Варна Технически университет, 9009, Варна кв. Васил Левски ул. Народен юмрук №3 зад Банка ДСК',
			'Варна Трошево, 9019, Варна кв. Трошево ул. Радост №8 до училище Добри Чинтулов',
			'Варна Христо Ботев, 9029, Варна Център бул. Христо Ботев №18',
			'Варна Цветен квартал, 9026, Варна Район Приморски ул. Бели лилии №20 м-н 3',
			'Варна Чайка, 9012, Варна кв. Чайка блок.68 партер (на гърба на Пощенски к',
			'Варна Чаталджа, 9008, Варна Район Приморски ул. Княз Николаевич №34 зад пазара за цветя',
			'Варна Червен площад, 9001, Варна Район Приморски ул. Цар Асен №50',
			'Варна, 9035, Варна кв. Западна Промишлена Зона Завод Метал',

			'Велики Преслав, 9853, Велики Преслав кв. Велики Преслав ул. Борис Спиров №28',

			'Велико Търново Бузлуджа, 5007, Велико Търново ж.к. Бузлуджа ул. Димитър Благоев №40',
			'Велико Търново България, 5008, Велико Търново кв. Велико Търново бул. България №21',
			'Велико Търново Зоната, 5012, Велико Търново кв. Велико Търново ул. Стоян Коледаров №44',
			'Велико Търново Картала, 5009, Велико Търново кв. Картала ул. Стоян Михайловски №9 магазин 2а',
			'Велико Търново Мизия, 5004, Велико Търново кв. Велико Търново ул. Мизия №28',
			'Велико Търново пл. Славейков, 5006, Велико Търново кв. Варуша пл. Пенчо Славейков №5 до Халите',
			'Велико Търново Христо Ботев, 5011, Велико Търново кв. Велико Търново ул. Христо Ботев №28',
			'Велико Търново, 5010, Велико Търново кв. Кольо Фичето ул. Полтава №3Ж',

			'Велинград Рубин, 4603, Велинград ул. Св. Св. Кирил и Методий №5',
			'Велинград Съединение, 4604, Велинград бул. Съединение №140',
			'Велинград, 4600, Велинград ул. Пазарска №2',
			'Ветово, 7081, Ветово ул. Васил Левски №1',

			'Видин Авангард Калето, 3700, Видин Видин ул. Княз Борис I №10',
			'Видин Крум Бъчваров, 3701, Видин Видин ул. Райко Жензифов №0 блок.21 до бл. 27',
			'Видин Площад Ташкюприя, 3703, Видин Видин ул. Екзарх Йосиф I №45',
			'Видин Ровно, 3704, Видин Видин ул. Цар Александър II №71',

			'Враца - Драгомир Антов, 30018, Враца ж.к. Металург ул. Никола Вапцаров №18',
			'Враца 24/7 Еконтомат - ТЦ Суми, 3009, Враца бул. Демокрация №16 Търговски комплекс "СУМИ"',
			'Враца Автогара, 3001, Враца ул. Васил Кънчов №76',
			'Враца Дъбника, 3004, Враца ж.к. Дъбника блок.32 2',
			'Враца Левски, 3006, Враца кв. 72 ул. Генерал Леонов №77',
			'Враца пл.Руски, 3003, Враца ул. Христо Ботев №77',
			'Враца РЦ населено място, 3000, Враца ж.к. Металург ул. Никола Вапцаров №18',
			'Враца, 3008, Враца ж.к. Металург ул. Никола Вапцаров №18',

			'Вълчедръм, 3651, Вълчедръм ул. България №17',
			'Вършец, 3542, Вършец кв. Вършец ул. Хан Омуртаг №8',

			'Габрово - Георги Трифонов, 53018, Габрово кв. Габрово ул. Доктор Заменхоф №3 Под Автогарата',
			'Габрово - Людмил Антов, 53028, Габрово кв. Габрово ул. Доктор Заменхоф №3 Под Автогарата',
			'Габрово ЕСА, 5304, Габрово кв. Младост ул. Златна Нива №9',
			'Габрово Мадара, 5301, Габрово кв. Габрово ул. Орловска №27',
			'Габрово Театъра, 5303, Габрово кв. Габрово ул. Св. Св. Кирил и Методий №10 срещу Куклен театър',
			'Габрово Шиваров мост, 5305, Габрово кв. Габрово ул. Йосиф Соколски №4',
			'Габрово, 5306, Габрово кв. Габрово ул. Доктор Заменхоф №3 Под Автогарата',

			'Генерал Тошево, 9504, Генерал Тошево ул. Трети Март №9',
			'Главиница, 7631, Главиница кв. Главиница ул. Розова долина №1',
			'Горна Оряховица Гарата, 5105, Горна Оряховица кв. Горна Оряховица ул. Цар Освободител №95',
			'Горна Оряховица Пролет, 5104, Горна Оряховица кв. Пролет ул. Д-р Петър Берон №4',
			'Горна Оряховица Шейново, 5102, Горна Оряховица кв. Горна Оряховица ул. Шейново №10',
			'Горна Оряховица, 5103, Горна Оряховица кв. Горна Оряховица ул. Вичо Грънчаров №9А',

			'Гоце Делчев Дунав, 2902, Гоце Делчев ул. Дунав №26',
			'Гоце Делчев Неврокоп, 2903, Гоце Делчев кв. Гоце Делчев ул. Генерал Ковачев №6',
			'Гоце Делчев, 2900, Гоце Делчев кв. Гоце Делчев ул. Драма №35',

			'Гълъбово, 6280, Гълъбово кв. Гълъбово ул. Александър Стамболийски №33',
			'Две Могили, 7150, Две Могили кв. Две могили ул. Шипка №1',
			'Девин Васил Левски, 4803, Девин кв. Девин ул. Васил Левски №29',
			'Девня, 9162, Девня кв. Девня бул. Съединение №0 до бензиностанция Лукойл',
			'Джебел, 6852, Джебел ул. Еделвайс №44',

			'Димитровград Автогара Пазара, 6404, Димитровград кв. Каменец ул. Димитър Благоев №2',
			'Димитровград Естило, 6403, Димитровград кв. Димитровград ул. Петър Парапанов №12-14 зад Кауфланд',
			'Димитровград Тенискортове, 6402, Димитровград кв. Димитровград ул. Хр.Ботев №46',
			'Димитровград Форум, 6401, Димитровград кв. Димитровград ул. Димитър Благоев №16',

			'Добринище, 2777, Добринище кв. Добринище ул. Александър Стамболийски №1',

			'Добрич - Емил Стоянов, 93018, Добрич кв. Северна промишлена зона ул. Ангел Стоянов №2 сграда на Стилстрой',
			'Добрич 24/7 Еконтомат - спирка Стоматология, 9313, Добрич ул. Отец Паисий №25',
			'Добрич Балик, 9305, Добрич кв. Балик ул. Христо Ботев №95',
			'Добрич Георги Кирков, 9307, Добрич кв. Добрич ул. Георги Кирков №26',
			'Добрич Добричка епопея, 9303, Добрич кв. Добрич ул. Хан Тервел №65',
			'Добрич Летен Театър, 9308, Добрич кв. Добрич ул. Генерал Колев №28',
			'Добрич Пазара, 9312, Добрич кв. Добрич ул. Гоце Делчев №15',
			'Добрич Родина, 9309, Добрич кв. Добрич ул. 25 септември №45',
			'Добрич Русия, 9310, Добрич кв. Добрич бул. Русия №19',
			'Добрич, 9311, Добрич кв. Северна промишлена зона ул. Ангел Стоянов №2 сграда на Стилстрой',

			'Долна Митрополия, 5857, Долна Митрополия кв. Долна Митрополия ул. Свети Свети Кирил и Методий №41',
			'Долна Оряховица, 5131, Долна Оряховица кв. Долна Оряховица ул. Георги Измирлиев №9',
			'Долни Дъбник, 5870, Долни Дъбник кв. Долни Дъбник ул. Асен Златаров №16',
			'Доспат, 4831, Доспат кв. Доспат ул. Тракия №10',
			'Дряново, 5370, Дряново кв. Дряново ул. Стара Планина №1',
			'Дулово, 7650, Дулово кв. Дулово ул. Петко Рачев Славейков №5А',
			'Дупница Патриарха, 2604, Дупница ул. Патриарх Евтимий №11 (до Севдината фурна)',
			'Дупница Тихия кът, 2603, Дупница кв. Дупница ул. Николаевска №59',
			'Дупница, 2602, Дупница кв. Дупница ул. Македония №29 до старата автогара',
			'Елена, 5071, Елена кв. Елена ул. Иларион Макариополски №42',
			'Елин Пелин Площада, 2101, Елин Пелин кв. Елин Пелин ул. Елин Пелин №13',
			'Елин Пелин, 2100, Елин Пелин кв. Елин Пелин бул. Новоселци №95',
			'Елхово, 8700, Елхово кв. Елхово ул. Александър Стамболийски №29',
			'Етрополе, 2180, Етрополе кв. Етрополе бул. Партизански №35',
			'Златица, 2081, Златица кв. Златица ул. Св. св. Кирил и Методий №27',
			'Златоград, 4980, Златоград кв. Златоград ул. Стефан Стамболов №2А',
			'Ивайловград, 6571, Ивайловград кв. Ивайловград ул. Любимец №1',
			'Исперих, 7400, Исперих кв. Исперих ул. Родопи №1',
			'Ихтиман, 2050, Ихтиман кв. Ихтиман ул. Стипон №3',

			'Каварна, 9650, Каварна кв. Каварна бул. България №57 Сити център',

			'Казанлък Ден, 6100, Казанлък кв. Казанлък ул. Алеко Константинов №2 юг',
			'Казанлък Изток, 6105, Казанлък ж.к. Изток ул. Кремона №26 под блок 20',
			'Казанлък Манастира, 6103, Казанлък кв. Манастира ул. Александър Стамболийски №7',
			'Казанлък Склад Батенберг, 6101, Казанлък ж.к. Изток бул. Княз Александър Батенберг №221',
			'Казанлък Терес, 6104, Казанлък кв. Казанлък бул. Никола Петков №29',

			'Казичене, 1532, Казичене кв. Казичене ул. Хан Крум №4',
			'Калипетрово, 7539, Калипетрово ул. Ново Петрово №48',
			'Калояново, 4173, Калояново ул. Асен Гаргов №27',
			'Калофер, 4370, Калофер кв. Калофер ул. 9 септември №10',
			'Камено, 8121, Камено Камено ул. Георги Димитров №19',

			'Карлово Пазара, 4303, Карлово кв. Карлово ул. Иван Вазов №47',
			'Карлово Хан Крум, 4301, Карлово кв. Карлово ул. Хан Крум №33',
			'Карлово, 4302, Карлово кв. Карлово ул. Юмрукчал №36',

			'Карнобат, 8402, Карнобат кв. Карнобат ул. Хаджи Димитър №2',
			'Каспичан, 9930, Каспичан кв. Каспичан ул. Мадарски конник №107',
			'Кирково, 6884, Кирково кв. Кирково ул. Димитър Благоев №23',
			'Кнежа Общината, 5836, Кнежа кв. Кнежа ул. Огнян Михайлов №1',
			'Козлодуй Георги Димитров, 3322, Козлодуй ж.к. 1 блок.8 бл. 8-9',
			'Козлодуй, 3320, Козлодуй кв. Козлодуй Търговска №11',
			'Комотини, 69100, Комотини Орфей Орфей №32',
			'Костенец, 2031, Костенец кв. Костенец ул. Боровец №10',
			'Костинброд, 2231, Костинброд кв. Костинброд ул. Славянска №50',
			'Котел, 8970, Котел ул. Ген. Иван Кишелски №11',
			'Крумовград, 6900, Крумовград кв. Крумовград ул. Княз Борис I №6',
			'Кубрат, 7302, Кубрат ул. Княз Борис №23',
			'Куклен, 4103, Куклен ул. Христо Г. Данов №21',

			'Кърджали - Здравко Иванов, 66048, Кърджали Студен кладенец ул. Марин Батуров №5 (База Петрол)',
			'Кърджали България, 6606, Кърджали кв. Кърджали бул. България №101',
			'Кърджали Васил Априлов, 6601, Кърджали кв. Кърджали ул. Екзарх Йосиф №6',
			'Кърджали Веселчане, 6603, Кърджали кв. Веселчане ул. Първи май №7',
			'Кърджали Възрожденци, 6602, Кърджали кв. Възрожденци бул. Христо Ботев №104 оф. 4',
			'Кърджали РЦ, 6604, Кърджали Студен кладенец ул. Марин Батуров №5 (База Петрол)',
			'Кърджали, 6605, Кърджали кв. Кърджали ул. Металург №2А',

			'Кюстендил Авангард, 2503, Кюстендил кв. Кюстендил ул. Даскал Димитри №31',
			'Кюстендил Батенберг, 2502, Кюстендил кв. Кюстендил ул. Александър Батенберг №19',
			'Кюстендил Мориц Леви, 2501, Кюстендил кв. Кюстендил ул. Мориц Леви №1',

			'Левски, 5901, Левски ул. Малчика №17',
			'Ловеч Автогара, 5503, Ловеч кв. Ловеч ул. Полковник Александър Кусев №6',
			'Ловеч Вароша, 5509, Ловеч ул. Търговска №13',
			'Ловеч Пазара, 5505, Ловеч Кооперативен пазар ул. Георги С .Раковски №1 до сладкарница Фаворит',
			'Ловеч, 5506, Ловеч кв. Младост бл. 302',
			'Логистичен Център Еконт, 7003, Русе кв. Източна Промишлена Зона',
			'Лозен, 1151, Лозен кв. Горни Лозен ул. Съединение №127Г',
			'Лозенец, 8277, Лозенец ул. Велека №15',
			'Лом Площада, 3602, Лом кв. Лом Площада ул. Дунавска №10',
			'Лом Хан Аспарух, 3600, Лом кв. Лом Хан Аспарух ул. Хан Аспарух №5',
			'Луковит, 5770, Луковит кв. Луковит ул. Възраждане №56',
			'Любимец, 6551, Любимец кв. Любимец ул. Христо Ботев №67',
			'Лясковец РЦ, 5141, Лясковец кв. Лясковец Околовръстен път на гр.Килифар',
			'Лясковец Трети март, 5143, Лясковец кв. Лясковец ул. Трети март №5',
			'Мадан, 4901, Мадан кв. Мадан ул. Република №6',
			'Мартен, 7058, Мартен кв. Мартен ул. Александър Невски №13',
			'Мездра, 3100, Мездра кв. Мездра ул. Динко Петров №2',
			'Мизия, 3330, Мизия кв. Мизия ул. Генерал Гурко №1',
			'Мобилен РЦ (Ружинци), 39009, Мобилен РЦ (Ружинци) кв. Мобилен Ружинци №1',
			'Мобилен РЦ, 4852, Мобилен РЦ кв. Мобилен ул. Променлива №1',
			'Момчилград, 6800, Момчилград кв. Момчилград ул. Маказа №3',
			'Монтана Младост 2, 3405, Монтана кв. Монтана бул. Монтана №27',
			'Монтана Пъстрина, 3404, Монтана ж.к. Пъстрина бул. Александър Стамболийски №58',
			'Монтана Театъра, 3402, Монтана кв. Монтана ул. Извора №7Б',
			'Монтана, 3401, Монтана кв. Монтана бул. Трети март №13',
			'Несебър – Николай Станчев, 823028, Несебър кв. Несебър ул. Еделвайс №43',
			'Несебър Склад, 8231, Несебър кв. Несебър №1 на входа за Несебър и Слънчев',
			'Несебър, 82301, Несебър кв. Несебър ул. Еделвайс №43',
			'Нова Загора Базара, 8902, Нова Загора кв. Нова Загора ул. Петко Енев №78 (срещу Горското)',
			'Нова Загора В.Левски, 8900, Нова Загора кв. Нова Загора ул. Васил Левски №65',
			'Нови Искър Кумарица, 1282, Нови Искър ул. Искърско дефиле №120А',
			'Нови Искър, 1280, Нови Искър кв. ЖП гара Курило ул. Търговска №18',
			'Нови Пазар, 9900, Нови Пазар кв. Нови Пазар ул. Княз Борис №18',
			'Обзор, 8252, Обзор кв. Обзор ул. Трети март №3',
			'Омуртаг, 7901, Омуртаг кв. Омуртаг ул. Родопи №38',
			'Оряхово, 3300, Оряхово кв. Оряхово ул. 6-ти септември №22',
			'Павел баня, 6155, Павел Баня ул. Освобождение №31',
			'Павликени Цар Иван Асен, 5202, Павликени кв. Павликени ул. Цар Иван Асен II №1 зад хотела на центъра',
			'Павликени, 5203, Павликени кв. Павликени пл. Стефан Караджа №16 (до Магазин Абсолют плюс)',

			'Пазарджик Булаир, 4409, Пазарджик кв. Център ул. Булаир №27',
			'Пазарджик Запад, 4406, Пазарджик кв. Запад бул. Христо Ботев №88 (срещу ресторант Вайрон)',
			'Пазарджик Канала, 4407, Пазарджик кв. Вароша бул. България №55',
			'Пазарджик Механото, 4401, Пазарджик ул. Тодор Каблешков №10',
			'Пазарджик Пазара, 4408, Пазарджик кв. Център ул. Цар Симеон №1',
			'Пазарджик, 4402, Пазарджик ул. Мильо войвода №5',

			'Панагюрище Сити Център, 4501, Панагюрище кв. Панагюрище пл. 20-ти април №1 Общински пазар',
			'Панагюрище, 4500, Панагюрище кв. Панагюрище ул. Георги Бенковски №25',
			'Перник 24/7 Еконтомат - Начална спирка, 2308, Перник ул. Отец Паисий №45',
			'Перник Даскалово, 2306, Перник кв. Перник ул. Петър Пенчев №12',
			'Перник Изток, 2307, Перник кв. Изток ул. Минск №3 Пазар Изток',
			'Перник Пазара, 2301, Перник кв. Перник ул. Розова долина №3',
			'Перник Пашов, 2309, Перник ул. Бродо №3',
			'Перущица, 4225, Перущица Иван Вазов №73',
			'Петрич Ален мак, 2853, Петрич кв. Петрич Вардар №2',
			'Петрич Монопола, 2850, Петрич кв. Петрич ул. кап. Никола Парапанов №18А',
			'Петрич Промишлена зона, 2852, Петрич кв. Промишлена зона ул. Места №18',
			'Пещера България, 4552, Пещера кв. Пещера ул. Георги Кьосеиванов №52',
			'Пещера Изгрев, 4551, Пещера кв. Пещера ул. Петър Цикалов №15',
			'Пирдоп, 2071, Пирдоп кв. Пирдоп бул. Цар Освободител №57 блок.56 вх.Б',

			'Плевен - Владимир Йорданов, 58048, Плевен кв. Плевен ул. Кара Колю №5А',
			'Плевен - Пламен Найденов, 58028, Плевен кв. Плевен ул. Кара Колю №5А',
			'Плевен - Чавдар Христев, 58018, Плевен кв. Плевен ул. Кара Колю №5А',
			'Плевен 24/7 Еконтомат - Гарата, 5816, Плевен кв. Плевен пл. Иван Мендиликов №8',
			'Плевен Васил Левски, 5806, Плевен кв. Плевен ул. Васил Левски №74',
			'Плевен Възраждане, 5811, Плевен кв. Плевен ул. Бъкстон №7',
			'Плевен Дружба, 5810, Плевен ж.к. Дружба ул. България №4',
			'Плевен Метро, 5814, Плевен кв. Плевен ул. Метро №11',
			'Плевен Неофит Рилски, 5807, Плевен кв. Плевен ул. Неофит Рилски №33',
			'Плевен РЦ, 5800, Плевен кв. Плевен ул. Кара Колю №5А',
			'Плевен Сан Стефано, 5812, Плевен кв. Плевен ул. Сан Стефано №31',
			'Плевен Стара Гара, 5815, Плевен кв. Плевен ул. Сторгозия №165 до магазин СИКО',
			'Плевен Сторгозия, 5813, Плевен ж.к. Сторгозия зад 39 блок',
			'Плевен Хаджи Димитър, 5802, Плевен 9-ти квартал ул. Хаджи Димитър №42 до сладкарница Космос',
			'Плевен Христо Ботев, 5808, Плевен кв. Плевен бул. Христо Ботев №94',
			'Плевен_ВИРТУАЛЕН, 58009, Плевен кв. Плевен ул. Георги Кочев №94',
			'Плевен, 5803, Плевен Източна Индустриална Зона ул. Кара Колю №5А Малкото кръгово колело до заво',

			'Пловдив 24/7 Еконтомат - Тракия, 4052, Пловдив ж.к. Тракия бул. Съединение №43 блок.100',
			'Пловдив Автогара Родопи, 4028, Пловдив кв. Автогара Родопи ул. Калиакра №7А',
			'Пловдив Арчарица, 4015, Пловдив Район Централен ул. Арчарица №1',
			'Пловдив Беласица, 4002, Пловдив Район Централен ул. Беласица №49',
			'Пловдив Брезовско шосе, 4040, Пловдив кв. Пловдив ул. Брезовско шосе №145А под хотел Филипополис',
			'Пловдив Васил Левски, 4032, Пловдив Район Северен бул. Васил Левски №214 “Карловско шосе”',
			'Пловдив ВИП, 4009, Пловдив Район Централен ул. Хан Тервел №15',
			'Пловдив Гербера кв.Тракия, 4005',
			'Пловдив Дунав, 4046, Пловдив кв. Захарна фабрика ул. Йоан Екзарх №17',
			'Пловдив ЖП Гара, 4045, Пловдив кв. Пловдив бул. Христо Ботев №7',
			'Пловдив Изгрев, 4026, Пловдив ж.к. Изгрев ул. Острец №12',
			'Пловдив Каменица, 4048, Пловдив кв. Каменица',
			'Пловдив Капана, 4010, Пловдив ул. Стефан Веркович №3 Бивша агенция по вписванията',
			'Пловдив Кичук Париж, 4013, Пловдив кв. Кичук Париж ул. Таврия №9',
			'Пловдив Коматево, 4006, Пловдив кв. Коматево ул. Коматевско шосе №193',
			'Пловдив Кършиака, 4003, Пловдив кв. Кършиака ул. Средец №60',
			'Пловдив Мараша, 4031, Пловдив кв. Мараша ул. Иван Радославов №6',
			'Пловдив Марица, 4014, Пловдив кв. Мараша бул. Марица №50',
			'Пловдив Матевски, 4023, Пловдив ж.к. Тракия ул. Съединение №13',
			'Пловдив Метро 1, 4050, Пловдив кв. Пловдив ул. Капитан Коста Паница №6',
			'Пловдив Митницата, 4043, Пловдив Район Южен ул. Кукленско Шосе №1 в автокомплекс Лем Инвест',
			'Пловдив Младежка, 4035, Пловдив кв. Мараша ул. Младежка №37',
			'Пловдив Мортагон, 4027, Пловдив Район Централен ул. Мортагон №5',
			'Пловдив Орфей, 4047, Пловдив кв. Пловдив ул. Орфей №24',
			'Пловдив Пазар Тракия, 4049, Пловдив ж.к. Тракия ул. Недялка Шилева №2 блок.173',
			'Пловдив Панаира, 4029, Пловдив кв. Гагарин бул. България №4 в двора на к-с ОРИ Билдинг',
			'Пловдив Прослав, 4037, Пловдив кв. Прослав ул. Елин Пелин №30',
			'Пловдив Руски, 4034, Пловдив Район Централен ул. Драган Цанков №47',
			'Пловдив РЦ населено място, 4000, Пловдив Район Южен ул. Кукленско Шосе №12',
			'Пловдив Свобода, 4019, Пловдив Район Централен ул. Тунджа №10',
			'Пловдив Север, 4024, Пловдив Район Северен ул. Георги Бенев №3',
			'Пловдив Скобелева майка, 4038, Пловдив кв. Скобелева майка ул. Георги Цариградски №6',
			'Пловдив Смирненски, 4016, Пловдив ж.к. Христо Смирненски бул. Пещерско шосе №105',
			'Пловдив Сточна гара, 4053, Пловдив ул. Авксентий Велешки №47',
			'Пловдив Събота Пазар, 4042, Пловдив кв. Пловдив ул. Даме Груев №11',
			'Пловдив Съдийски, 4041, Пловдив кв. Съдийски ул. Георги Груев №6',
			'Пловдив Тепето, 4004, Пловдив Район Централен бул. Пещерско шосе №28А',
			'Пловдив Тракия, 4007, Пловдив ж.к. Тракия блок.45 .',
			'Пловдив Търговска зона, 4036, Пловдив Район Северен ул. Брезовско шосе №4а',
			'Пловдив Христо Ботев, 4018, Пловдив кв. Христо Ботев ул. Константин Геров №6',
			'Пловдив Южен, 4033, Пловдив Район Южен бул. Александър Стамболийски №35',
			'Пловдив_ВИРТУАЛЕН, 40009, Пловдив Район Южен ул. Кукленско Шосе №12',
			'Пловдив, 4044, Пловдив Район Южен ул. Кукленско Шосе №11',

			'Полски Тръмбеш, 5181, Полски Тръмбеш кв. Полски тръмбеш ул. Търговска №32',
			'Поморие Нов град, 8204, Поморие ул. Княз Борис І №175А срещу манастира',
			'Поморие, 8203, Поморие ул. Княз Борис І №96А',
			'Попово, 7800, Попово кв. Попово бул. България №117',
			'Правец, 2165, Правец ж.к. Север ул. Димитър Грънчаров №23',
			'Прага, 500600, Прага Прага str. U plynárny №1290/99 101 36 Praha 10',
			'Приморско, 8291, Приморско кв. Приморско ул. Ропотамо №47',
			'Провадия, 9202, Провадия кв. Провадия ул. Генерал Манзей №1',
			'Първомай, 4270, Първомай кв. Първомай ул. Орфей №1а',
			'Равда, 8221, Равда кв. Равда ул. Делфин №3',
			'Раднево, 6261, Раднево кв. Раднево ул. Здравец №10',
			'Радомир, 2400, Радомир кв. Радомир ул. Райко Даскалов №26',

			'Разград Автогара, 7203, Разград кв. Разград ул. връх Св. Никола №2 бивш магазин Росстел',
			'Разград Бели Лом, 7201, Разград кв. Разград ул. Осъм №30 блока зад БИЛЛА',
			'Разград Орел, 7204, Разград ж.к. Орел ул. Юмрукчал №19 срещу входа на Т Маркет',

			'Разлог Предела, 2761, Разлог ул. Г.С.Раковски №5',
			'Разлог, 2760, Разлог кв. Разлог ул. Бяла река №4б',
			'Ракитово, 4640, Ракитово ул. Братя Кръстини №1',
			'Раковски Секирово, 4153, Раковски ул. Трети март №41',
			'Раковски, 4152, Раковски Генерал Николаево бул. Георги Сава Раковски №38',
			'Рудозем, 4960, Рудозем кв. Рудозем Васил Левски №9 ап.2',

			'Русе - Атанас Атанасов, 70048, Русе кв. Източна Промишлена Зона бул. Тутракан №11',
			'Русе - Димитър Горанов, 70068, Русе кв. Източна Промишлена Зона бул. Тутракан №11',
			'Русе - Илиян Пейков, 70058, Русе кв. Източна Промишлена Зона бул. Тутракан №11',
			'Русе - Цветелин Деков, 70038, Русе кв. Източна Промишлена Зона бул. Тутракан №11',
			'Русе 24/7 Еконтомат - Покрит пазар, 7032, Русе кв. Възраждане ул. Тулча №15 Закрит пазар',
			'Русе Бизнес Парк, 7034, Русе ж.к. Здравец Изток бул. Липник №123',
			'Русе Борисова, 7006, Русе ж.к. ЦЮР ул. Видин №1',
			'Русе Буда Хаус, 7027, Русе Централна зона ул. Добруджа №4',
			'Русе Волов, 7035, Русе кв. Дружба 1 бул. Христо Ботев №1',
			'Русе Възраждане, 7019, Русе кв. Възраждане ул. Плиска №52',
			'Русе Градски площад, 7028, Русе Централна зона ул. Асен Златаров №20',
			'Русе Западна зона, 7036, Русе кв. Западна промишлена зона бул. Трети март №0 сграда Зита',
			'Русе Здравец, 7008, Русе ж.к. Здравец ул. Захари Стоянов №16',
			'Русе Кръговото, 7022, Русе Пазара ул. Люляк №11',
			'Русе Локомотив, 7005, Русе Локомотив ул. Плиска №91',
			'Русе Мототехника, 7033, Русе ж.к. Здравец Изток бул. Липник №135',
			'Русе Николаевска, 7013, Русе ж.к. ЦЮР ул. Николаевска №109',
			'Русе Родина, 7023, Русе кв. Родина ул. Чипровци №27',
			'Русе РЦ Населено място, 7000, Русе кв. Източна Промишлена Зона бул. Тутракан №11',
			'Русе Солун, 7026, Русе кв. Възраждане ул. Солун №25',
			'Русе Търговска, 7037, Русе ж.к. Здравец Изток ул. Акад. Михаил Арнаудов №2',
			'Русе Халите, 7020, Русе Централна зона ул. Цар Фердинанд №1',
			'Русе Чародейка, 7038, Русе жк. Чародейка Г-юг блок.213 .',
			'Русе_ВИРТУАЛЕН, 70009, Русе кв. Източна Промишлена Зона бул. Тутракан №11',
			'Русе, 7029, Русе кв. Пристанище Изток бул. Тутракан №44Б',

			'Самоков кв.Самоково, 2002, Самоков кв. Самоково ул. Преспа №15',
			'Самоков Площада, 2001, Самоков кв. Самоков ул. Цар Борис 3 №3 блок.18',
			'Самоков, 2000, Самоков кв. Самоков ул. Македония №70',
			'Сандански Базилика, 2802, Сандански ул. Христо Ботев №13',
			'Сандански Стамболов, 2801, Сандански кв. Сандански ул. Стефан Стамболов №6',
			'Сандански, 2800, Сандански кв. Сандански ул. Георги Бенковски №15',
			'Свети Влас, 8256, Свети Влас кв. Център ул. Свети Власий №1 зад хотел Александра',
			'Свиленград Младост, 6501, Свиленград кв. Свиленград ул. 23-ти септември №71',
			'Свиленград, 6500, Свиленград бул. България №60 на гърба на Уникредит Булбанк',
			'Свищов Велешана, 5252, Свищов кв. Свищов ул. Опълченска №16',
			'Свищов Студентски град, 5251, Свищов кв. Свищов ул. Трети март №93',
			'Свищов, 5250, Свищов кв. Свищов ул. Ал. Стамболийски №3',
			'Своге, 2260, Своге кв. Своге бул. Цар Симеон №45 Автогара',
			'Севлиево 24/7 Еконтомат - Общината, 5403, Севлиево кв. Севлиево пл. Свобода №1 зад РУМ',
			'Севлиево пл. Свобода, 5404, Севлиево ул. Шипка №8 до УниКредит Булбанк',
			'Севлиево, 5402, Севлиево кв. Севлиево ул. Никола Петков №41А срещу Лидл',
			'Септември, 4491, Септември кв. ЖП гара ул. Любен Каравелов №13',
			'Силистра Аврора ОМВ, 7502, Силистра ул. София №80',
			'Силистра Дап, 7505, Силистра кв. Силистра ул. Тулча №8',
			'Силистра Македония, 7504, Силистра кв. Силистра бул. Македония №152',
			'Симеоновград, 6492, Симеоновград кв. Симеоновград ул. Търговска №8',
			'Симитли, 2730, Симитли ул. Георги Димитров №74',
			'Склад Липсващи пратки, 70027, Русе кв. Източна Промишлена Зона бул. Тутракан №11',

			'Сливен 24/7 Еконтомат - МБАЛ, 8805, Сливен ул. Христо Ботев №1 пред МБАЛ',
			'Сливен Аксаков, 8801, Сливен кв. Сливен ул. Генерал Драгомиров №10 К-с Париж вътрешна страна',
			'Сливен Бр. Миладинови, 8811, Сливен бул. Братя Миладинови №12',
			'Сливен Българка, 8807, Сливен комплекс Българка блок.27 вход от южната страна',
			'Сливен Васил Левски, 8806, Сливен кв. Сливен пл. Васил Левски №5',
			'Сливен Дружба, 8804, Сливен кв. Дружба ул. Стефан Стамболов №4 обект 8',
			'Сливен Клуцохор, 8803, Сливен кв. Клуцохор ул. Хан Крум №43',
			'Сливен Панайот Хитов, 8808, Сливен кв. Сливен ул. Панайот Хитов №37',
			'Сливен Промишлена зона, 8809, Сливен кв. Сливен Самуиловско шосе №1А',
			'Сливен Светлина, 8800, Сливен кв. Индустриален ул. Стефан Караджа №6 50м навътре от портала',

			'Сливница, 2200, Сливница кв. Сливница ул. Георги Бенковски №2',
			'Сливо поле, 7060, Сливо Поле пл. Иван Рилски №1',
			'Слънчев бряг Автогара, 8242, Слънчев Бряг кв. Камелия до Автогарата',
			'Слънчев бряг Вива, 8241, Слънчев Бряг кв. Чайка до Поликлиника Вива',
			'Слънчев бряг Пасифик, 8243, Слънчев Бряг ул. Първа №0 срещу дискотека Ориндж',
			'Смолян Военно окръжие, 4705, Смолян кв. Смолян ул. Христо Смирненски №2а',
			'Смолян Райково, 4703, Смолян кв. Райково ул. Деспот Слав №1',
			'Смолян, 4704, Смолян кв. Смолян ул. Бузлуджа №7 дълбоко дере',
			'Созопол Републиканска, 8130, Созопол Созопол ул. Републиканска №28',
			'Солун, 500901, Солун str. Salaminos №10',
			'Сопот, 4330, Сопот Сопот ул. Ганчо поп Николов №17',

			'София - Ангел Величков, 10038, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Антоан Смилев, 10258, София кв. Горубляне бул. Самоковско шосе №2Л',
			'София - Асен Асенов, 10228, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Асен Каракашев, 10308, София жк Люлин-1 ул. 3019 №1',
			'София - Асен Паичев, 10218, София жк Люлин-1 ул. 3019 №1',
			'София - Асен Станимиров, 11038, София кв. Горубляне бул. Самоковско шосе №2Л',
			'София - Генади Димитров, 10138, София кв. Горубляне бул. Самоковско шосе №2Л',
			'София - Георги Глинджев, 10318, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Георги Иванов, 10148, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Георги Китенов, 10198, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Георги Лазаров, 10238, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Данаил Друмев, 12018, София жк Люлин-1 ул. 3019 №1',
			'София - Димитър Узунски, 10078, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Иван Василев, 10188, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Иво Досев, 10048, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Илиян Медарски, 11028, София кв. Горубляне бул. Самоковско шосе №2Л',
			'София - Коста Москов, 10068, София жк Люлин-1 ул. 3019 №1',
			'София - Красимир Кръстев, 10278, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Милен Пенков, 10158, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Михаил Игнатов, 12028, София жк Люлин-1 ул. 3019 №1',
			'София - Михаил Михайлов, 12058, София жк Люлин-1 ул. 3019 №1',
			'София - Никола Николов, 12068, София жк Люлин-1 ул. 3019 №1',
			'София - Николай Ваклинов, 10298, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Николай Крушаров, 10108, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Николай Спасов, 10128, София кв. Горубляне бул. Самоковско шосе №2Л',
			'София - Николай Тасев, 10168, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Радко Радков, 12048, София жк Люлин-1 ул. 3019 №1',
			'София - Румен Йолов, 10098, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Светослав Грозданов, 10178, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Сергей Кирилов, 10058, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Стефан Тюрлесанов, 10268, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Стоян Вълчанов, 10118, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Тодор Костов, 10248, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Тодор Пантелеев, 10028, София жк Хаджи Димитър ул. Резбарска №9',
			'София - Цеко Иванов, 10088, София жк Хаджи Димитър ул. Резбарска №9',

			'София 24/7 Еконтомат - OMV Ботевградско шосе, 1701, София кв. Враждебна бул. Ботевградско шосе №264 бензиностанция OMV',
			'София 24/7 Еконтомат - OMV България, 1705, София бул. България №49А',
			'София 24/7 Еконтомат - OMV Владимир Вазов, 1711, София бул. Владимир Вазов №1',
			'София 24/7 Еконтомат - OMV Г.М.Димитров, 1706, София бул. Д-р Г.М.Димитров №55',
			'София 24/7 Еконтомат - OMV Ломско шосе, 1708, София бул. Ломско шосе №2',
			'София 24/7 Еконтомат - OMV Люлин 10, 1704, София бул. Царица Йоана №1 до магазин Лабиринт',
			'София 24/7 Еконтомат - OMV Резбарска, 1710, София ул. Резбарска №4',
			'София 24/7 Еконтомат - OMV Рожен, 1707, София бул. Рожен №20E',
			'София 24/7 Еконтомат - OMV Столетов, 1709, София бул. Ген. Столетов №33',
			'София 24/7 Еконтомат - OMV Цариградско шосе, 1703, София кв. Младост-1 бул. Цариградско шосе №56 бензиностанция OMV Окръжна бол',

			'София Аксаков, 1107, София ул. Аксаков №15',
			'София Арсеналски, 1102, София жк Лозенец бул. Арсеналски №7 м-н 1',
			'София Бели брези, 1077, София жк Белите брези ул. Хайдушка гора №47',
			'София Бели Дунав, 1103, София кв. Надежда 3 блок.330 -',
			'София Бенковски, 1155, София кв. Бенковски бул. Лазар Михайлов №122',
			'София Бигла, 1034, София жк Лозенец ул. Бигла №37',
			'София Бизнес Парк, 1003, София кв. Младост-4 блок.438 партер',
			'София Бокар, 1137, София кв. Манастирски ливади - Изток блок.64 вх.А офис 2',
			'София Борис Стефанов, 1083, София жк Студентски град ул. Акад.Борис Стефанов №2',
			'София Борово, 1119, София жк Борово блок.227 вх.А офис 4',
			'София Борса Къра, 1129, София кв. Полигона бул. Проф. Цветан Лазаров №4-8 Борса Къра',
			'София Бояна, 1158, София кв. Бояна ул. Севастократор Калоян №63',
			'София БЦ Витоша, 1120, София жк Лозенец бул. Черни връх №47',
			'София Вас метал, 1169, София кв. Враждебна бул. Ботевградско шосе №276',
			'София Военна Рампа, 1062, София Промишлена зона Военна рампа бул. Илиянци №12',
			'София Гара искър, 1032, София Промишлена зона Искър (Гара Искър) ул. Мюнхен №14',
			'София Гладстон, 1012, София ул. Цар Самуил №3',
			'София Горна баня, 1163, София кв. Горна Баня ул. Инж. Борислав Огойски №2',
			'София Горубляне, 1064, София кв. Горубляне ул. Пионерска №5',
			'София Гурко, 1141, София ул. Кузман Шапкарев №5',
			'София Гюешево БЦ Сердика, 1149, София жк Сердика ул. Гюешево №83',
			'София Делийска воденица, 1088, София жк Дружба-2 ул. Делийска воденица №5 срещу блок 314',
			'София Дианабад, 1052, София жк Дианабад ул. Тинтява №27',
			'София Драгалевци, 1106, София кв. Драгалевци ул. Папрат №18',
			'София Дружба 1, 1055, София жк Дружба-1 блок.108 .',
			'София Дружба 2, 1116, София жк Дружба-2 ул. Илия Бешков №12 до м-н Мания',
			'София Дървеница, 1157, София жк Дървеница бул. Андрей Ляпчев №11',
			'София Емил Марков, 1167, София жк Гоце Делчев бул. Тодор Каблешков №24 срещу бензиностанция Петрол',
			'София Западен парк, 1113, София жк Западен парк бул. Александър Стамболийски №196',
			'София Захари Стоянов, 1144, София жк Люлин-4 бул. Захари Стоянов - кв. Люлин №1 до блок 403',
			'София Иван Вазов, 1148, София жк Иван Вазов бул. Витоша №150',
			'София Изток, 1011, София жк Изток ул. Николай Хайтов №2 (срещу Интерпред в локалното п',
			'София Илиянци - База 1, 1013, София кв. Илиянци ул. Петър Панайотов №3',
			'София Илиянци - Втора база, 1153, София кв. Илиянци ул. Петър Панайотов №12 Втора база',
			'София кв.Витоша, 1080, София кв. Витоша ул. Асен Разцветников №14А',
			'София Кемпински, 1004, София жк Лозенец ул. Капитан Тодор Ночев №28',
			'София Княжево, 1164, София бул. Цар Борис III №355',
			'София Козлодуй, 1049, София ул. Козлодуй №23',
			'София Константин Величков, 1076, София жк Зона Б-18 бул. Константин Величков №3',
			'София Красна поляна, 1118, София жк Красна поляна-3 ул. Колю Фичето №0 до бл.31Б',
			'София Красно село, 1005, София жк Красно село ул. Царица Елеонора №12',
			'София Кръстова вада, 1072, София кв. Кръстова вада бул. Черни връх №154',
			'София Лагера, 1104, София жк Лагера ул. Балчик №5',
			'София Левски, 1038, София ул. Княгиня Тамара №40',
			'София Линкълн, 1123, София кв. Овча купел 1 бул. Президент Линкълн №62 срещу блокове 523-524',
			'София Ломско шосе, 1112, София кв. Надежда 1 блок.173 вх.Ж Партер',
			'София Лъвов мост, 1132, София кв. Барите ул. Поп Богомил №38',
			'София Любляна, 1086, София кв. Овча купел 1 ул. Любляна №22A',
			'София Люлин 1 Европа, 1139, София жк Люлин-1 блок.002',
			'София Люлин 5, 1140, София жк Люлин-5 блок.519 вх.В до аптека Медея',
			'София Люлин, 1015, София жк Люлин-8 ул. 3011 №5 срещу Булгаргаз',
			'София Малашевци, 1037, София кв. Малашевци ул. Първа Българска армия №82',
			'София Манастирски ливади, 1085, София кв. Манастирски ливади - Запад ул. Иван Сусанин №54Б',
			'София Младост 1, 1056, София ул. Йерусалим №54 блок.54',
			'София Младост 1А Пътеките, 1079, София кв. Младост-1А блок.508 бл.508',
			'София Младост 2, 1069, София кв. Младост-2 блок.205Б бл.205б',
			'София Младост Окръжна болница, 1117, София кв. Младост-1 ул. Усмивка №23 Търговски комплекс М и С',
			'София Младост, 1026, София кв. Младост-3 ул. Филип Аврамов №1 блок.342 вх.1',
			'София Модерно предградие, 1110, София кв. Модерно Предградие ул. Методи Македонски №20',
			'София Момина клисура, 1078, София жк Сухата река бул. Ботевградско шосе №4 блок.4',
			'София Моста Чавдар, 1027, София пл. Чавдар №1',
			'София Мусагеница, 1146, София кв. Младост-1 блок.110 зад магазин Т-маркет (Мусагени',
			'София Нюман, 1108, София Промишлена зона Военна рампа ул. Проф. Иван Георгов №3',
			'София Обеля 1, 1058, София кв. Обеля 1 блок.121 бл. 121',
			'София Обеля 2, 1082, София кв. Обеля 2 бул. Ломско шосе №207',
			'София Овча купел 2, 1166, София кв. Овча купел 2 бул. Президент Линкълн №116 (Базар Ситиком)',
			'София Овча купел, 1051, София кв. Овча купел 1 ул. Маестро Кънев №78 до НБУ',
			'София Одрин, 1024, София ул. Одрин №156',
			'София Опълченска, 1075, София жк Банишора ул. Опълченска №117 блок.54',
			'София Орион, 1138, София жк Люлин-10 ул. Луи Пастьор №103А пресечната на бул.Луи Пастьор',
			'София Орландовци, 1150, София кв. Орландовци ул. Мара Бунева №59',
			'София Орлов мост, 1068, София жк Яворов ул. Виктор Юго №7',
			'София Павлово, 1041, София кв. Павлово ул. Мадара №1',
			'София Паметника Левски, 1081, София бул. Янко Сакъзов №14',
			'София Плиска, 1090, София бул. Шипченски проход №18 Търговски център Галакси',
			'София Разсадника, 1130, София кв. Разсадника ул. Позитано №165',
			'София Раковски, 1121, София ул. Георги Сава Раковски №79-81',
			'София Редута, 1115, София кв. Редута ул. Блага Димитрова №23',
			'София Римска стена, 1160, София ул. Арх. Йордан Миланов №4',
			'София Руски паметник, 1061, София кв. Крива река ул. Люлин планина №17',
			'София РЦ Искър, 1100, София кв. Горубляне бул. Самоковско шосе №2Л',
			'София РЦ Населено място, 1000, София жк Хаджи Димитър ул. Резбарска №9',
			'София РЦ Орион, 1200, София жк Люлин-1 ул. 3019 №1',
			'София Света Троица, 1035, София жк Света Троица бл. 304',
			'София Свобода, 1073, София жк Свобода ул. Ген.Никола Жеков №22 вход от ул.Дилянка',
			'София Силвър Център Люлин, 1065, София жк Люлин-7 бул. Джавахарлал Неру №1 блок.769 магазин 2',
			'София Симеоново, 1154, София бул. Симеоновско шосе №166 вх.Б магазин Б3',
			'София Слатина, 1161, София кв. Слатина ул. Иван Димитров - Куклата №15',
			'София Стамболийски - бул. Ал. Стамболийски 87, 1016, София бул. Александър Стамболийски №87',
			'София Стамболийски - ул. Осогово 36, 1152, София ул. Осогово №36',
			'София Стрелбище, 1165, София жк Стрелбище ул. Тулча №37',
			'София Студентски град, 1009, София жк Студентски град ул. Проф. Атанас Иширков - кв. Студентски град №11',
			'София Сухата река, 1168, София бул. Владимир Вазов №20 м-н Била',
			'София Технически Университет, 1043, София жк Дървеница ул. Проф. Георги Брадистилов №6',
			'София Толстой, 1131, София кв. Надежда 2 ул. Стражица №7',
			'София Универсиада, 1007, София жк Гео Милев ул. Борис Христов №18-20',
			'София Фондови жилища, 1025, София жк Фондови жилища блок.203 .',
			'София Хаджи Димитър, 1097, София жк Хаджи Димитър пред блок 102',
			'София Хиподрума, 1089, София ул. Софийски герой №4',
			'София Христо Смирненски, 1136, София ул. Слатинска №1 блок.35',
			'София Цар Самуил, 1060, София ул. Цар Самуил №74',
			'София Цар Симеон, 1001, София ул. Цар Симеон №133',
			'София Цариградски комплекс, 1125, София жк Дружба-2 блок.284 до вход Ж',
			'София Цариградско шосе, 1022, София бул. Цариградско шосе №129 7-ми км до АТМ център',
			'София Челопечене, 1162, София ул. Ангел Маджаров №51-71',
			'София Черковна, 1126, София кв. Подуяне ул. Черковна №60',
			'София_ВИРТУАЛЕН, 10009, София жк Хаджи Димитър ул. Резбарска №9',
			'София, 1127, София жк Хаджи Димитър ул. Резбарска №11',

			'Спорт Депо Виртуален, 11001, София кв. Младост-4 ул. Васил Радославов №6 Сграда Спорт Депо',
			'Средец, 8301, Средец Средец ул. Лиляна Димитрова №1А',
			'Стамболийски, 4211, Стамболийски кв. 57 Цар Симеон №40',

			'Стара Загора - Христо Христов, 60018, Стара Загора кв. Голеш ул. Хрищенско шосе №30',
			'Стара Загора 24/7 Еконтомат - Център, 6018, Стара Загора бул. Цар Симеон Велики №105',
			'Стара Загора Гурко, 6017, Стара Загора кв. Стара Загора ул. Генерал Гурко №4',
			'Стара Загора ЖПГара, 6013, Стара Загора кв. Стара Загора ул. Герасим Папазчев №8',
			'Стара Загора Индустриален, 6007, Стара Загора кв. Индустриален ул. Индустриална №1',
			'Стара Загора кв.Железник, 6010, Стара Загора кв. Железник бул. Цар Симеон Велики до м-н Зорa',
			'Стара Загора Мартинели, 6014, Стара Загора кв. Индустриален зад магазин Мартинели',
			'Стара Загора Мототехника, 6016, Стара Загора кв. Стара Загора бул. Цар Симеон Велики №161',
			'Стара Загора Площад Берое, 6012, Стара Загора кв. Стара Загора ул. Свещеник Георги Клисаров №15',
			'Стара Загора Раковски, 6011, Стара Загора кв. Стара Загора ул. Георги Сава Раковски №59',
			'Стара Загора Три Чучурa, 6015, Стара Загора кв. Три Чучура ул. Никола Икономов №5',
			'Стара Загора Хаджи Д.Асенов, 6001, Стара Загора кв. Стара Загора ул. Хаджи Димитър Асенов №95',
			'Стара Загора Цар Иван Шишман, 6003, Стара Загора кв. Стара Загора ул. Цар Иван Шишман №42',

			'Стражица, 5152, Стражица Стражица ул. Михал Друмев №1',
			'Стрелча, 4530, Стрелча бул. България №67',
			'Суворово, 9171, Суворово кв. Суворово ул. Бачо Киро №1А',
			'Съединение, 4190, Съединение кв.Точиларци бул. България №46А',
			'Сърница, 4633, Сърница кв. Сърница ул. Свобода №36',
			'Твърдица, 8890, Твърдица Твърдица ул. Хан Аспарух №13',
			'Тервел, 9451, Тервел Тервел ул. Гео Милев №13',
			'Тетевен ВИП, 5701, Тетевен Тетевен ул. Първи ноември №27',
			'Тополовград, 6560, Тополовград Тополовград ул. Христо Смирненски №18',
			'Троян Каравелов, 5601, Троян Троян ул. Кирил и Методий №17 срещу Държавно Горско Стопанст',
			'Троян Лъгът, 5602, Троян ж.к. Лъгът №',
			'Троян, 5600, Троян Троян ул. Димитър Икономов Димитриката №23 сградата на автогарата',
			'Труд, 4199, Труд кв. Труд ул. Янтра №2Б',
			'Трявна, 5351, Трявна Трявна ул. Бачо Киро №9',
			'Тутракан, 7600, Тутракан Тутракан ул. Родина №10',
			'Търговище - Атанас Драганов, 77018, Търговище кв. Индустриална зона бивша Родопа',
			'Търговище Запад, 7704, Търговище Търговище бул. Сюрен №1',
			'Търговище Пазара, 7706, Търговище ул. Генерал Скобелев №1 магазин Булмаг',
			'Търговище Театъра, 7701, Търговище Търговище ул. Петко Р. Славейков №36',
			'Търговище, 7705, Търговище кв. Индустриална зона бивша Родопа',
			'Управление (Русе), 7002, Русе кв. Източна Промишлена Зона бул. Тутракан №11а',
			'Харманли Пазара, 6451, Харманли кв. Център ул. Марин Велев №1',
			'Харманли, 6450, Харманли Харманли ул. Стефан Льондев №1',

			'Хасково - Бранимир Берберов, 63018, Хасково Източна индустриална зона бул. Съединение №64',
			'Хасково Kняз Борис, 6305, Хасково Дружба 1 ул. Княз Борис I №3',
			'Хасково XXI -ви век, 6301, Хасково ж.к. Овчарски ул. Драгоман №42',
			'Хасково Веспрем, 6306, Хасково кв. Орфей кв. Веспрем №1 блок.22 сграда Козирог',
			'Хасково кв.Бадема, 6302, Хасково Места №1',
			'Хасково кв.Хисаря, 6307, Хасково кв. Хисаря ул. Лом №1',
			'Хасково Орфей, 6303, Хасково кв. Орфей ул. Димитровградско шосе №22 Сервиз Peugeot',
			'Хасково РЦ, 6300, Хасково Източна индустриална зона бул. Съединение №64',
			'Хасково Цар Освободител, 6304, Хасково кв. Училищни ул. Цар Освободител №41',
			'Хасково, 6308, Хасково Източна индустриална зона бул. Съединение №66',

			'Хермес3, 19003, Wien Wien',
			'Хисаря, 4180, Хисаря Хисаря ул. Любен Каравелов №1',
			'Хотели и ресторанти Е4Y, 70028, Русе кв. Източна Промишлена Зона бул. Тутракан №11',
			'Царево, 8260, Царево Царево ул. Михаил Герджиков №1',
			'Чепеларе, 4854, Чепеларе кв. Чепеларе ул. Васил Дечев №13',
			'Червен бряг 24/7 Еконтомат - Център, 5982, Червен Бряг кв. Червен бряг ул. Отец Паисий №6',
			'Червен Бряг Общината, 5981, Червен Бряг кв. Червен бряг ул. Г. С. Раковски №24',
			'Чирпан Георги Димитров, 6204, Чирпан кв. Чирпан бул. Георги Димитров №75',
			'Чирпан Площада, 6202, Чирпан кв. Чирпан ул. Братя Даскалови №10',

			'Шумен 24/7 Еконтомат - Херсон, 9712, Шумен бул. Велики Преслав №1 кръстовището на бул. Велики Пр',
			'Шумен Дивдядово, 9708, Шумен кв. Дивдядово бул. Велики Преслав №136',
			'Шумен Осми март, 9707, Шумен кв. Шумен ул. Петра №22',
			'Шумен Руски Паметник, 9710, Шумен кв. Шумен ул. Алеко Константинов №9',
			'Шумен Скобелев, 9711, Шумен кв. Шумен ул. Генерал Скобелев №42',
			'Шумен Тракия, 9705, Шумен Тракия бул. Симеон Велики №25',
			'Шумен Турбо, 9703, Шумен кв. Шумен ул. Оборище №6',
			'Шумен Цар Освободител, 9701, Шумен кв. Шумен ул. Цар Освободител №114',
			'Шумен, 9709, Шумен кв. Шумен бул. Мадара №1',

			'Щръклево, 7078, Щръклево ж.к. Щръклево ул. Централна №35А',

			'Ямбол Автогара Батак, 8611, Ямбол ул. Страшимир Кринчев №1 блок 1',
			'Ямбол Бенковски, 8608, Ямбол ж.к. Георги Бенковски до бл.14',
			'Ямбол Граф Игнатиев, 8606, Ямбол ж.к. Граф Игнатиев до бл.78',
			'Ямбол Златен рог, 8609, Ямбол ж.к. Златен рог №81 Зад 11-ти блок',
			'Ямбол Индустриална, 8610, Ямбол Индустриална №1 малката търговия',
			'Ямбол Искър, 8601, Ямбол гара гара Ямбол ул. Искър №1А',
			'Ямбол Трите вятъра, 8603, Ямбол ул. Дружба №1',
			'Ямбол, 8604, Ямбол пл. Боровец бул. Димитър Благоев №20 до пожарната'
		];

		$('.js-ekont-autocomplete').autocomplete({
			minLength: 0,
			multiple: true,
			mustMatch: false,
			separator: ', ',
			source: EkontAddresses
		});
	}



	// hide textarea desc on click
	checkoutBlock.find('textarea').click(function () {
		$(this).parent().addClass('active');
	});

	// hide textarea desc on click
	$('.block_checkout__comment__desc').click(function () {
		$(this).parent().addClass('active');
	});

	// hide textarea desc after kep up if it still empty
	checkoutBlock.find('textarea').blur(function () {
		comment_check();
	});
});


function checkSaturdayDeliveryChangePrice() {
	var deliveryOptions = $('.js-block_checkout__delivery_type').find('input');
	var descriptionElement;

	// find the one with value 2, it's delivery to address
	deliveryOptions.each(function () {
		if ($(this).val() === "2") {
			descriptionElement = $(this).parent().find('.block_checkout__desc')
		};
	});

	if (isDeliveryOnSaturday) {
		descriptionElement.text(descriptionElement.text().replace("8.8", "11.6"));
	} else {
		descriptionElement.text(descriptionElement.text().replace("11.6", "8.8"));
	}
}


function comment_check() {
	var comment         = $('.block_checkout').find('textarea');
	var comment_val     = comment.val();

	// textarea is not empty
	if ( comment_val !== "" ) {
		comment.parent().addClass('active');
	}
	// textarea is empty
	else {
		comment.parent().removeClass('active');
	}
}

function block_checkout__check_input() {
	var block_checkout__form = $('.block_checkout').find('form');

	block_checkout__form.find('input[type="text"]').each(function () {
		if ( !$(this).val() ) {}
		else {
			$(this).parent().removeClass('error').addClass('accepted');
		}
	});
}



// AJAX calc form [START]
function block_checkout__form__submit() {
	var messageDelay = 2000;

	var block_checkout__form            = $('.block_checkout').find('form');

	var deliverySurprise                = block_checkout__form.find('input[name="block_checkout__delivery_surprise"]');
	var deliverySurpriseVal             = 'нет';



	check_delivery_surprise_status();



	deliverySurprise.change(function () {
		check_delivery_surprise_status();
	});

	function check_delivery_surprise_status() {
		// is surprise delivery
		if ( deliverySurprise.is(':checked') ) {
			$('html').addClass('block_checkout__delivery_surprise__active');
		}
		// is NOT surprise delivery
		else {
			$('html').removeClass('block_checkout__delivery_surprise__active');
		}
	}



	// check after focus out
	block_checkout__form.find('input[type="text"]').blur(function () {
		if ( !$(this).val() ) {
			$(this).parent().addClass('error').removeClass('accepted');
		}
		else {
			$(this).parent().removeClass('error').addClass('accepted');
		}
	});

	block_checkout__form.submit(block_checkout__submit);



	function block_checkout__submit() {
		var address;

		// is surprise delivery
		if ( deliverySurprise.is(':checked') ) {
			deliverySurpriseVal = 'да';
		}
		// is NOT surprise delivery
		else {}

		var comment                         = block_checkout__form.find('#block_checkout__comment');
		var date                            = block_checkout__form.find('input[name="block_checkout__date"]');
		var comment_and_delivery_date       = 'Доставка сюрприз: ' + deliverySurpriseVal + ' | Дата доставки: ' + date.val() + ' | ' + comment.val();



		var deliverySurpriseEmail           = block_checkout__form.find('input[name="block_checkout__delivery_surprise__email"]');
		var deliverySurpriseName            = block_checkout__form.find('input[name="block_checkout__delivery_surprise__name"]');
		var deliverySurprisePhone           = block_checkout__form.find('input[name="block_checkout__delivery_surprise__phone"]');

		var comment_with_delivery_info      = 'Имя заказчика: ' + deliverySurpriseName.val() + ' | Телефон заказчика: ' + deliverySurprisePhone.val() + ' | ' + comment_and_delivery_date;

		// add extra info about surprise delivery if surprise delivery choosen
		if ( deliverySurprise.is(':checked') ) {
			comment_and_delivery_date = comment_with_delivery_info;
		}



		var delivery_type                   = block_checkout__form.find('input[name="block_checkout__delivery_type"]');
		var delivery_type__checked          = block_checkout__form.find('input[name="block_checkout__delivery_type"]:checked');
		var city                            = block_checkout__form.find('input[name="block_checkout__city"]');
		var ekont                           = block_checkout__form.find('input[name="block_checkout__ekont"]');
		var email                           = block_checkout__form.find('input[name="block_checkout__email"]');
		var house                           = block_checkout__form.find('input[name="block_checkout__house"]');
		var name                            = block_checkout__form.find('input[name="block_checkout__name"]');
		var name_2                          = block_checkout__form.find('input[name="block_checkout__name_2"]');
		var next_step                       = 0;

		var payment_type                    = block_checkout__form.find('input[name="block_checkout__payment_type"]');
		var phone                           = block_checkout__form.find('input[name="block_checkout__phone"]');
		var privacy                         = block_checkout__form.find('input[name="block_checkout__privacy"]');
		var privacy_checked                 = block_checkout__form.find('input[name="block_checkout__privacy"]:checked');

		var street                          = block_checkout__form.find('input[name="block_checkout__street"]');

		// ekont address
		if ( delivery_type__checked.val() == 1 ) {
			address = ekont.val();
		}
		// home address
		else {
			address = city.attr('placeholder') + ': ' + city.val() + ', ' + street.attr('placeholder') + ': ' + street.val() + ', ' + house.attr('placeholder') + ': ' + house.val();
		}



		// check inputs when submit [START]
		// remove error class to all inputs
		block_checkout__form.find('input').parent().removeClass('error');



		// name
		if ( !name.val() ) {
			name.parent().addClass('error').removeClass('accepted').focus();

			$('body, html').animate({
				scrollTop: name.offset().top - 200
			}, 700);

			console.log('error at name');
		}

		// second name
		else if ( !name_2.val() ) {
			name.parent().addClass('accepted');

			name_2.parent().addClass('error').removeClass('accepted').focus();

			$('body, html').animate({
				scrollTop: name_2.offset().top - 200
			}, 700);

			console.log('error at name_2');
		}

		// phone
		else if ( !phone.val() ) {
			name_2.parent().addClass('accepted');

			phone.parent().addClass('error').removeClass('accepted').focus();

			$('body, html').animate({
				scrollTop: phone.offset().top - 200
			}, 700);

			console.log('error at phone');
		}

		// email
		else if ( !email.val() ) {
			phone.parent().addClass('accepted');

			email.parent().addClass('error').removeClass('accepted').focus();

			$('body, html').animate({
				scrollTop: email.offset().top - 200
			}, 700);

			console.log('error at email');
		}

		// date
		else if ( !date.val() ) {
			email.parent().addClass('accepted');

			date.parent().addClass('error').removeClass('accepted').focus();

			$('body, html').animate({
				scrollTop: date.offset().top - 200
			}, 700);

			console.log('error at date');
		}

		// surprise delivery or not
		else if ( deliverySurprise.is(':checked') ) {
			// surprise delivery name
			if ( !deliverySurpriseName.val() ) {
				date.parent().addClass('accepted');

				deliverySurpriseName.parent().addClass('error').removeClass('accepted').focus();

				$('body, html').animate({
					scrollTop: deliverySurpriseName.offset().top - 200
				}, 700);

				console.log('error at deliverySurpriseName');
			}

			// surprise delivery phone
			else if ( !deliverySurprisePhone.val() ) {
				date.parent().addClass('accepted');

				deliverySurprisePhone.parent().addClass('error').removeClass('accepted').focus();

				$('body, html').animate({
					scrollTop: deliverySurprisePhone.offset().top - 200
				}, 700);

				console.log('error at deliverySurprisePhone');
			}
			else {
				next_step = 1;

				console.log('surprise delivery is checked. No errors. Continue...');
			}
		}
		else {
			next_step = 1;

			console.log('surprise delivery NOT checked. Continue...');
		}



		// continue checking | delivery_type
		if ( next_step > 0 ) {
			// delivery_type
			if (!delivery_type.is(':checked')) {
				date.parent().addClass('accepted');

				delivery_type.parent().addClass('error').removeClass('accepted');

				$('body, html').animate({
					scrollTop: delivery_type.offset().top - 200
				}, 700);

				console.log('error at delivery_type');

				next_step = 0;
			}

			// delivery_ekont
			else if (block_checkout__form.find('input[name="block_checkout__delivery_type"]:checked').val() == 1) {
				if (!ekont.val()) {
					ekont.parent().addClass('error').removeClass('accepted');

					$('body, html').animate({
						scrollTop: ekont.offset().top - 200
					}, 700);

					next_step = 0;
				}
				else {
					next_step = 1;
				}
			}

			// delivery_home
			else if (block_checkout__form.find('input[name="block_checkout__delivery_type"]:checked').val() == 2) {
				if (!city.val()) {
					city.parent().addClass('error').removeClass('accepted');

					$('body, html').animate({
						scrollTop: city.offset().top - 200
					}, 700);

					next_step = 0;
				}
				else if (!street.val()) {
					street.parent().addClass('error').removeClass('accepted');

					$('body, html').animate({
						scrollTop: street.offset().top - 200
					}, 700);

					next_step = 0;
				}
				else if (!house.val()) {
					house.parent().addClass('error').removeClass('accepted');

					$('body, html').animate({
						scrollTop: house.offset().top - 200
					}, 700);

					next_step = 0;
				}
				else {
					next_step = 1;
				}
			}
			else {
				next_step = 0;
			}
		}



		// continue checking | payment_type
		if ( next_step > 0 ) {
			// payment_type
			if ( !payment_type.is(':checked') ) {
				payment_type.parent().addClass('error').removeClass('accepted');

				$('body, html').animate({
					scrollTop: payment_type.offset().top - 200
				}, 700);

				next_step = 0;
			}
			else {
				next_step = 1;
			}
		}



		// continue checking | pivacy policy checked
		if ( next_step > 0 ) {
			// privacy policy checked
			if (privacy_checked.length > 0) {
				privacy.parent().removeClass('error').addClass('accepted');

				next_step = 1;
			}
			else {
				next_step = 0;

				privacy.parent().addClass('error').removeClass('accepted');

				$('body, html').animate({
					scrollTop: privacy.offset().top - 200
				}, 700);

				console.log('error: privacy policy NOT checked');
			}
		}



		// send order
		if ( next_step > 0 ) {
			// show popup with loading
			$('html').addClass('popup_order__active').delay(30000).queue(function() {
				if ( !$(this).hasClass('popup_order__complete') ) {
					$(this).removeClass('popup_order__active').addClass('popup_error__active').dequeue();
				}
			});

			// load checkout default form to hidden div
			$('.checkout__ajax').load('index.php?route=checkout/checkout #accordion', function () {
				console.log('step 1: start');
				// step 1 [START]
				$.ajax({
					url: 'index.php?route=checkout/login',
					dataType: 'html',
					success: function(html) {
						$('#collapse-checkout-option .panel-body').html(html);

						console.log('step 2: start');
						// step 2 [START]
						// #button-account
						$.ajax({
							url: 'index.php?route=checkout/guest',
							dataType: 'html',
							success: function(html) {
								$('#collapse-payment-address .panel-body').html(html);

								$('input[value="guest"]').prop('checked', true);

								var default_firstname   = $('#input-payment-firstname');
								var default_lastname    = $('#input-payment-lastname');
								var default_email       = $('#input-payment-email');
								var default_phone       = $('#input-payment-telephone');
								var default_address     = $('#input-payment-address-1');

								default_firstname.val( name.val() );
								default_lastname.val( name_2.val() );
								default_email.val( email.val() );
								default_phone.val( phone.val() );
								default_address.val( address );

								// console.log( address );

								console.log('step 3: start');
								// step 3 [START]
								// #button-guest
								$.ajax({
									url: 'index.php?route=checkout/guest/save',
									type: 'post',
									data: $('#collapse-payment-address input[type=\'text\'], #collapse-payment-address input[type=\'date\'], #collapse-payment-address input[type=\'datetime-local\'], #collapse-payment-address input[type=\'time\'], #collapse-payment-address input[type=\'checkbox\']:checked, #collapse-payment-address input[type=\'radio\']:checked, #collapse-payment-address input[type=\'hidden\'], #collapse-payment-address textarea, #collapse-payment-address select'),
									dataType: 'json',
									success: function(json) {
										console.log('step 4: start');
										// step 4 [START]
										$.ajax({
											url: 'index.php?route=checkout/shipping_method',
											dataType: 'html',
											success: function(html) {
												// Add the shipping address
												console.log('step 5: start');
												// step 5 [START]
												$.ajax({
													url: 'index.php?route=checkout/guest_shipping',
													dataType: 'html',
													success: function(html) {
														// step 6 [START]
														console.log('step 6: start');
														$('#collapse-shipping-address .panel-body').html(html);

														var default_comment = $('textarea[name="comment"]');
														default_comment.val( comment_and_delivery_date );

														// delivery home
														if ( block_checkout__form.find('input[name="block_checkout__delivery_type"]:checked').val() == 1 ) {
															$('input[name="shipping_method"][value="flat_ekont.flat_ekont"]').prop('checked', true);
														}
														// delivery_home
														else if ( block_checkout__form.find('input[name="block_checkout__delivery_type"]:checked').val() == 2 ) {
															if (isDeliveryOnSaturday) {
																$('input[name="shipping_method"][value="item.item"]').prop('checked', true);
															} else {
																$('input[name="shipping_method"][value="flat.flat"]').prop('checked', true);
															}
														}

														// #button-shipping-method
														$.ajax({
															url: 'index.php?route=checkout/shipping_method/save',
															type: 'post',
															data: $('#collapse-shipping-method input[type=\'radio\']:checked, #collapse-shipping-method textarea'),
															dataType: 'json',
															success: function(json) {
																// step 7 [START]
																console.log('step 7: start');
																$.ajax({
																	url: 'index.php?route=checkout/payment_method',
																	dataType: 'html',
																	success: function(html) {
																		// step 8 [START]
																		console.log('step 8: start');
																		$('#collapse-payment-method .panel-body').html(html);

																		// #button-payment-method
																		$.ajax({
																			url: 'index.php?route=checkout/payment_method/save',
																			type: 'post',
																			data: $('#collapse-payment-method input[type=\'radio\']:checked, #collapse-payment-method input[type=\'checkbox\']:checked, #collapse-payment-method textarea'),
																			dataType: 'json',
																			success: function(json) {
																				// step 9 [START]
																				console.log('step 9: start');
																				$.ajax({
																					url: 'index.php?route=checkout/confirm',
																					dataType: 'html',
																					success: function(html) {
																						// step 10 [START]
																						console.log('step 10: start');
																						$('#collapse-checkout-confirm .panel-body').html(html);

																						// $('#button-confirm').click();
																						$.ajax({
																							url: 'index.php?route=extension/payment/cod/confirm',
																							dataType: 'json',
																							success: function(json) {
																								console.log('Order passed!');

																								// $('html').addClass('popup_order__complete').dequeue();
																								$('html').addClass('popup_order__complete popup_error__hidden');
																							},
																							error: function(xhr, ajaxOptions, thrownError) {
																								console.log('step 10: error');
																								console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
																							}
																						});
																						// step 10 [END]
																					},
																					error: function(xhr, ajaxOptions, thrownError) {
																						console.log('step 9: error');
																						console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
																					}
																				});
																				// step 9 [END]
																			},
																			error: function(xhr, ajaxOptions, thrownError) {
																				console.log('step 8: error');
																				console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
																			}
																		});
																		// step 8 [END]
																	},
																	error: function(xhr, ajaxOptions, thrownError) {
																		console.log('step 7: error');
																		console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
																	}
																});
																// step 7 [END]
															},
															error: function(xhr, ajaxOptions, thrownError) {
																console.log('step 6: error');
																console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
															}
														});
														// step 6 [END]
													},
													error: function(xhr, ajaxOptions, thrownError) {
														console.log('step 5: error');
														console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
													}
												});

												$('#collapse-shipping-method .panel-body').html(html);
												// step 5 [END]
											},
											error: function(xhr, ajaxOptions, thrownError) {
												console.log('step 4: error');
												console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
											}
										});
										// step 4 [END]
									},
									error: function(xhr, ajaxOptions, thrownError) {
										console.log('step 3: error');
										console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
									}
								});
								// step 3 [END]
							},
							error: function(xhr, ajaxOptions, thrownError) {
								console.log('step 2: error');
								console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
							}
						});
						// step 2 [END]
					},
					error: function(xhr, ajaxOptions, thrownError) {
						console.log('step 1: error');
						console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
					}
				});
				// step 1 [END]
			});
		}

		return false;
	}
}



// check email
function isEmail(email) {
	var regex = /^([a-zA-Z0-9_.+-])+\@(([a-zA-Z0-9-])+\.)+([a-zA-Z0-9]{2,4})+$/;
	return regex.test(email);
}



// calculate total price with delivery
function cart_total() {
	var total           = 0;
	var delivery        = parseFloat( $('.block_checkout__total_delivery').find('.block_checkout__total_number').text() );
	var products_total  = 0;
	var quantity        = 0;



	$('.cart_table__price').each(function () {
		var product_price = parseFloat( $(this).text() );

		products_total = products_total + product_price;
	});

	total = total + products_total + delivery;



	$('.cart__quantity').each(function () {
		var current_quantity = parseFloat( $(this).text() );

		quantity = quantity + current_quantity;
	});

	$('.header__cart').find('> span').html(quantity);



	$('.block_checkout__total_final').find('.block_checkout__total_number').text( total );
	$('.block_checkout__total_products').find('.block_checkout__total_number').text( products_total );
}



// show or hide checkout if cart is empty
function cart_not_empty() {
	if ( $('.cart__content').find('table').length ) {
		$('.block_checkout').addClass('active');
	}
	else {
		$('.block_checkout').removeClass('active');
	}

	cart_replace_broken_links();
}



// update cart
function cart_update() {
	// scroll to block_cart
	// $('html, body').animate({
	// scrollTop: $('.block_cart__wrap').offset().top - 224
	// }, 700);

	$('.block_cart__wrap').load('index.php?route=common/cart/info #cart__content', function () {
		cart_total();

		cart_not_empty();
	});
}



// replace broken links at cart images with a symbol take from ALT
function cart_replace_broken_links() {
	$('.cart__option_item').find('img').each(function () {
		var img             = $(this);
		var img_src         = img.attr('src');
		var img_src__full   = window.location.origin + img_src;
		var img_alt         = img.attr('alt');

		$.ajax({
			url:    img_src__full,
			type:   'HEAD',
			error: function() {
				//file not exists
				// console.log(img_src__full);
				// console.log(img_alt);

				img.hide().parent().append('<span>' + img_alt + '</span>');
			},
			success: function() {
				//file exists
				// console.log(img_src__full);
				// console.log(img_alt);
			}
		});
	});
}



// Cart add remove functions
var cart = {
	'add': function(product_id, quantity) {
		$.ajax({
			url: 'index.php?route=checkout/cart/add',
			type: 'post',
			data: 'product_id=' + product_id + '&quantity=' + (typeof(quantity) != 'undefined' ? quantity : 1),
			dataType: 'json',
			success: function() {
				cart_update();
			},
			error: function(xhr, ajaxOptions, thrownError) {
				console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
			}
		});
	},
	'update': function(key, quantity) {
		$.ajax({
			url: 'index.php?route=checkout/cart/edit',
			type: 'post',
			data: 'key=' + key + '&quantity=' + (typeof(quantity) != 'undefined' ? quantity : 1),
			dataType: 'json',
			success: function() {
				cart_update();
			},
			error: function(xhr, ajaxOptions, thrownError) {
				console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
			}
		});
	},
	'remove': function(key) {
		$.ajax({
			url: 'index.php?route=checkout/cart/remove',
			type: 'post',
			data: 'key=' + key,
			dataType: 'json',
			success: function() {
				$('.block_cart__wrap').load('index.php?route=common/cart/info #cart__content', function () {
					cart_total();

					cart_not_empty();
				});
			},
			error: function(xhr, ajaxOptions, thrownError) {
				console.log(thrownError + "\r\n" + xhr.statusText + "\r\n" + xhr.responseText);
			}
		});
	}
}


